Aranykacsa/samd21-baremetal/src/examples/i2c.c
// samd21_aht20_sercom3.c
#include "samd21.h"
#include "system_samd21.h"
#include <stdint.h>
#include <stdio.h>

#include "i2c.h"
#include "clock.h"
#include "variables.h"


/* ==================== AHT20 (blocking, linear) ==================== */
static uint8_t aht20_init(i2c_t* bus, uint8_t addr7) {
  const uint8_t seq[3] = {0xBE,0x08,0x00};
  int rc = i2c_write(bus, addr7, seq);
  delay_ms(100);                                
  return (rc == 0) ? 0 : 1;
}

static uint8_t aht20_read(i2c_t* bus, uint8_t addr7, float *temp_c, float *hum_pct) {
  const uint8_t trig[3] = {0xAC,0x33,0x00};
  if (i2c_write(bus, addr7, trig) != 0) {
    // recover once
    i2c_swrst_reinit(bus);
    delay_ms(2);
    if (i2c_write(bus, addr7, trig) != 0) return 1;
  }

  delay_ms(90);                                

  uint8_t d[6];
  if (i2c_read(bus, addr7, d) != 0) {
    i2c_swrst_reinit(bus);
    delay_ms(2);
    if (i2c_read(bus, addr7, d) != 0) return 2;
  }

  if (d[0] & 0x80) {                          
    delay_ms(10);
    if (i2c_read(bus, addr7, d) != 0) return 3;
    if (d[0] & 0x80) return 4;
  }

  uint32_t humRaw  = ((uint32_t)d[1] << 12) | ((uint32_t)d[2] << 4) | (d[3] >> 4);
  uint32_t tempRaw = ((uint32_t)(d[3] & 0x0F) << 16) | ((uint32_t)d[4] << 8) | d[5];

  *hum_pct = (humRaw  * 100.0f) / 1048576.0f;
  *temp_c  = (tempRaw * 200.0f) / 1048576.0f - 50.0f;
  return 0;
}

int main(void) {
  SystemInit();                               
  SysTick_Config(SystemCoreClock / 1000);    

  PM->APBBMASK.reg |= PM_APBBMASK_PORT;
  PORT->Group[0].DIRSET.reg = (1u << 17);

  i2c_init(&i2c_s3);

  const uint8_t AHT_ADDR = 0x38;
  if (aht20_init(&i2c_s3, AHT_ADDR) != 0) {
    printf("AHT20 init FAILED\r\n");
  } else {
    printf("AHT20 init OK\r\n");
  }

  float t, h;
  uint32_t next = get_uptime();

  while (1) {
    if ((int32_t)(get_uptime() - next) >= 0) {
      next += 1000;                  // 1 Hz

      uint8_t rc = aht20_read(&i2c_s3, AHT_ADDR, &t, &h);
      if (rc == 0) {
        printf("T=%.1f C  RH=%.1f %%\r\n", (double)t, (double)h);
      } else {
        printf("AHT20 read err=%u\r\n", rc);
      }

      PORT->Group[0].OUTTGL.reg = (1u << 17);
    }
  }
}
